# BendAngle Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShapeVertex..::..BendAngle Property
RebarShapeVertex Class See Also
---
The range of permissible angles at this bend.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public RebarShapeBendAngle BendAngle { get; set; }
```

Visual Basic
---
```text
Public Property BendAngle As RebarShapeBendAngle
	Get
	Set
```

Visual C++
---
```text
public:
property RebarShapeBendAngle BendAngle {
	RebarShapeBendAngle get ();
	void set (RebarShapeBendAngle value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
RebarShapeVertex Class
Autodesk.Revit.DB.Structure Namespace